//------------------------------------------------------------------------------
// parallelepiped.cpp - содержит функции обработки параллелепипеда
//------------------------------------------------------------------------------

#include "parallelepiped.h"

//------------------------------------------------------------------------------
// Ввод параметров параллелепипеда из потока
void In(parallelepiped &p, ifstream &ifst) {
    ifst >> p.a >> p.b >> p.c;
}

// Случайный ввод параметров параллелепипедаconsole.log();
void InRnd(parallelepiped &p) {
    p.a = Random();
    p.b = Random();
    p.c = Random();
}

//------------------------------------------------------------------------------
// Вывод параметров параллелепипеда в поток
void Out(parallelepiped &p, ofstream &ofst)
{
    ofst << "It is a parallelepiped: a = " << p.a
         << ", b = " << p.b 
         << ", c = " << p.c
         << ". Surface area = " << SurfaceArea(p) << "\n";
}

//------------------------------------------------------------------------------
// Вывод параметров параллелепипеда в поток
void OutShort(parallelepiped &p, ofstream &ofst){
    ofst << 2 << "\n" << p.a << " " << p.b << " " << p.c << "\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра параллелепипеда
double SurfaceArea(parallelepiped &p) {
    return double(2 * (p.a * p.b + p.a * p.c + p.b * p.c));
}