//------------------------------------------------------------------------------
// tetrahedron.cpp - содержит функции обработки тетраэдра
//------------------------------------------------------------------------------

#include "tetrahedron.h"
#include "math.h"

//------------------------------------------------------------------------------
// Ввод параметров тетраэдра из потока
void In(tetrahedron &t, ifstream &ifst) {
    ifst >> t.a;
}

// Случайный ввод параметров тетраэдраconsole.log();
void InRnd(tetrahedron &t) {
    t.a = Random();    
}

//------------------------------------------------------------------------------
// Вывод параметров тетраэдра в поток
void Out(tetrahedron &t, ofstream &ofst)
{
    ofst << "It is a tetrahedron: a = " << t.a         
         << ". Surface area = " << SurfaceArea(t) << "\n";
}

// Вывод параметров тетраэдра в тестовый файл.
void OutShort(tetrahedron &t, ofstream &ofst){
    ofst <<3 <<"\n" << t.a <<"\n";
}

//------------------------------------------------------------------------------
// Вычисление периметра тетраэдра
double SurfaceArea(tetrahedron &t) {
    return sqrt(3) * t.a;
}