//------------------------------------------------------------------------------
// sphere.cpp - содержит функции обработки шара
//------------------------------------------------------------------------------

#include "sphere.h"
#define M_PI 3.14159265358979323846

//------------------------------------------------------------------------------
// Ввод параметров шара из потока
void Sphere::In(ifstream &ifst) {
    ifst >> r >> density;
}

// Случайный ввод параметров шара
void Sphere::InRnd() {
    r = Shape::rnd30.Get();
    density = Shape::rnd30.Get();
}

//------------------------------------------------------------------------------
// Вывод параметров шара в поток
void Sphere::Out(ofstream &ofst) {
    ofst << "It is a sphere: r = " << r
         << "; density = " << density
         << ". Surface area = " << SurfaceArea() << "\n";
}

//------------------------------------------------------------------------------
// Вывод параметров шара в тестовый файл.
void Sphere::OutShort(ofstream &ofst) {
    ofst << 1 << "\n" << r << " " << density;
}

//------------------------------------------------------------------------------
// Вычисление периметра шара
double Sphere::SurfaceArea() {
    return 4 * M_PI * r * r;
}
